---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementIntersectsSolidFilter
source: html/1f4fbbf4-6127-0664-67c9-2c45ae1ca1f9.htm
---
# ElementIntersectsSolidFilter Methods

Gets the target solid geometry.